inference/load_testing/vegeta/text_gen/summarization/flan/results1.txt
Requests      [total, rate, throughput]         5, 6.25, 3.33
Duration      [total, attack, wait]             1.502s, 799.983ms, 702.245ms
Latencies     [min, mean, 50, 90, 95, 99, max]  607.406ms, 805.355ms, 807.466ms, 1.007s, 1.007s, 1.007s, 1.007s
Bytes In      [total, mean]                     525, 105.00
Bytes Out     [total, mean]                     6675, 1335.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5  
Error Set:
Requests      [total, rate, throughput]         5, 6.25, 0.00
Duration      [total, attack, wait]             800.361ms, 799.977ms, 383.925µs
Latencies     [min, mean, 50, 90, 95, 99, max]  383.925µs, 581.664µs, 487.835µs, 1.022ms, 1.022ms, 1.022ms, 1.022ms
Bytes In      [total, mean]                     420, 84.00
Bytes Out     [total, mean]                     1675, 335.00
Success       [ratio]                           0.00%
Status Codes  [code:count]                      400:5  
Error Set:
400 Bad Request
Requests      [total, rate, throughput]         5, 6.25, 3.25
Duration      [total, attack, wait]             1.536s, 799.947ms, 736.5ms
Latencies     [min, mean, 50, 90, 95, 99, max]  521.59ms, 633.325ms, 660.112ms, 736.5ms, 736.5ms, 736.5ms, 736.5ms
Bytes In      [total, mean]                     485, 97.00
Bytes Out     [total, mean]                     9750, 1950.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:5  
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 6.53
Duration      [total, attack, wait]             1.531s, 899.976ms, 630.813ms
Latencies     [min, mean, 50, 90, 95, 99, max]  601.078ms, 727.823ms, 711.488ms, 861.49ms, 892.186ms, 892.186ms, 892.186ms
Bytes In      [total, mean]                     970, 97.00
Bytes Out     [total, mean]                     19500, 1950.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10  
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 6.30
Duration      [total, attack, wait]             1.588s, 899.977ms, 687.826ms
Latencies     [min, mean, 50, 90, 95, 99, max]  463.955ms, 743.664ms, 775.911ms, 905.996ms, 935.86ms, 935.86ms, 935.86ms
Bytes In      [total, mean]                     630, 63.00
Bytes Out     [total, mean]                     180, 18.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10  
Error Set:
Requests      [total, rate, throughput]         10, 11.11, 7.02
Duration      [total, attack, wait]             1.424s, 899.996ms, 523.626ms
Latencies     [min, mean, 50, 90, 95, 99, max]  523.626ms, 630.247ms, 605.582ms, 754.396ms, 785.124ms, 785.124ms, 785.124ms
Bytes In      [total, mean]                     300, 30.00
Bytes Out     [total, mean]                     160, 16.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:10  
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 8.27
Duration      [total, attack, wait]             1.814s, 933.294ms, 880.381ms
Latencies     [min, mean, 50, 90, 95, 99, max]  570.511ms, 715.622ms, 656.5ms, 946.986ms, 997.009ms, 1.014s, 1.014s
Bytes In      [total, mean]                     1575, 105.00
Bytes Out     [total, mean]                     3930, 262.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15  
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 8.97
Duration      [total, attack, wait]             1.672s, 933.312ms, 738.575ms
Latencies     [min, mean, 50, 90, 95, 99, max]  478.213ms, 639.844ms, 611.691ms, 805.208ms, 855.226ms, 871.899ms, 871.899ms
Bytes In      [total, mean]                     1230, 82.00
Bytes Out     [total, mean]                     13560, 904.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15  
Error Set:
Requests      [total, rate, throughput]         15, 16.07, 9.94
Duration      [total, attack, wait]             1.508s, 933.292ms, 575.017ms
Latencies     [min, mean, 50, 90, 95, 99, max]  373.719ms, 482.46ms, 485.516ms, 574.993ms, 625.018ms, 641.693ms, 641.693ms
Bytes In      [total, mean]                     915, 61.00
Bytes Out     [total, mean]                     2595, 173.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:15  
Error Set:
Requests      [total, rate, throughput]         20, 21.05, 11.34
Duration      [total, attack, wait]             1.764s, 949.975ms, 814.211ms
Latencies     [min, mean, 50, 90, 95, 99, max]  554.18ms, 746.958ms, 716.541ms, 939.082ms, 989.122ms, 1.014s, 1.014s
Bytes In      [total, mean]                     2040, 102.00
Bytes Out     [total, mean]                     12160, 608.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:20  
Error Set:
Requests      [total, rate, throughput]         20, 21.05, 15.55
Duration      [total, attack, wait]             1.286s, 949.987ms, 336.031ms
Latencies     [min, mean, 50, 90, 95, 99, max]  336.031ms, 441.744ms, 435.889ms, 535.006ms, 536.179ms, 536.438ms, 536.438ms
Bytes In      [total, mean]                     1660, 83.00
Bytes Out     [total, mean]                     5340, 267.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:20  
Error Set:
Requests      [total, rate, throughput]         20, 21.05, 14.98
Duration      [total, attack, wait]             1.335s, 949.976ms, 385.042ms
Latencies     [min, mean, 50, 90, 95, 99, max]  243.169ms, 326.342ms, 330.698ms, 392.333ms, 392.776ms, 392.861ms, 392.861ms
Bytes In      [total, mean]                     880, 44.00
Bytes Out     [total, mean]                     900, 45.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:20  
Error Set:
Requests      [total, rate, throughput]         30, 31.04, 14.39
Duration      [total, attack, wait]             2.085s, 966.55ms, 1.119s
Latencies     [min, mean, 50, 90, 95, 99, max]  701.139ms, 884.619ms, 864.489ms, 1.064s, 1.094s, 1.119s, 1.119s
Bytes In      [total, mean]                     3150, 105.00
Bytes Out     [total, mean]                     40050, 1335.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30  
Error Set:
Requests      [total, rate, throughput]         30, 31.03, 15.77
Duration      [total, attack, wait]             1.902s, 966.662ms, 935.682ms
Latencies     [min, mean, 50, 90, 95, 99, max]  579.896ms, 753.622ms, 723.799ms, 935.065ms, 968.854ms, 1.002s, 1.002s
Bytes In      [total, mean]                     2460, 82.00
Bytes Out     [total, mean]                     27120, 904.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30  
Error Set:
Requests      [total, rate, throughput]         30, 31.03, 20.56
Duration      [total, attack, wait]             1.459s, 966.653ms, 492.698ms
Latencies     [min, mean, 50, 90, 95, 99, max]  367.077ms, 513.796ms, 497.792ms, 627.313ms, 659.211ms, 692.69ms, 692.69ms
Bytes In      [total, mean]                     1830, 61.00
Bytes Out     [total, mean]                     5190, 173.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30  
Error Set:
Requests      [total, rate, throughput]         40, 41.03, 19.20
Duration      [total, attack, wait]             2.083s, 974.904ms, 1.108s
Latencies     [min, mean, 50, 90, 95, 99, max]  667.465ms, 854.128ms, 828.996ms, 1.029s, 1.078s, 1.108s, 1.108s
Bytes In      [total, mean]                     4080, 102.00
Bytes Out     [total, mean]                     24320, 608.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:40  
Error Set:
Requests      [total, rate, throughput]         40, 41.03, 16.13
Duration      [total, attack, wait]             2.479s, 974.949ms, 1.504s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.186s, 1.565s, 1.604s, 1.804s, 1.842s, 1.879s, 1.879s
Bytes In      [total, mean]                     3880, 97.00
Bytes Out     [total, mean]                     78000, 1950.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:40  
Error Set:
Requests      [total, rate, throughput]         40, 41.02, 22.01
Duration      [total, attack, wait]             1.817s, 975.016ms, 842.33ms
Latencies     [min, mean, 50, 90, 95, 99, max]  817.892ms, 1.013s, 998.472ms, 1.198s, 1.223s, 1.255s, 1.255s
Bytes In      [total, mean]                     4200, 105.00
Bytes Out     [total, mean]                     53400, 1335.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:40  
Error Set:
Requests      [total, rate, throughput]         50, 51.02, 30.55
Duration      [total, attack, wait]             1.637s, 979.956ms, 656.621ms
Latencies     [min, mean, 50, 90, 95, 99, max]  424.968ms, 586.218ms, 577.513ms, 720.67ms, 736.529ms, 756.524ms, 756.524ms
Bytes In      [total, mean]                     3050, 61.00
Bytes Out     [total, mean]                     8650, 173.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:50  
Error Set:
Requests      [total, rate, throughput]         50, 51.02, 31.03
Duration      [total, attack, wait]             1.611s, 979.971ms, 631.218ms
Latencies     [min, mean, 50, 90, 95, 99, max]  407.743ms, 568.374ms, 559.642ms, 706.378ms, 724.928ms, 731.22ms, 731.22ms
Bytes In      [total, mean]                     3050, 61.00
Bytes Out     [total, mean]                     8650, 173.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:50  
Error Set:
Requests      [total, rate, throughput]         50, 51.02, 24.01
Duration      [total, attack, wait]             2.083s, 979.972ms, 1.103s
Latencies     [min, mean, 50, 90, 95, 99, max]  660.404ms, 833.811ms, 810.372ms, 1.01s, 1.04s, 1.103s, 1.103s
Bytes In      [total, mean]                     5250, 105.00
Bytes Out     [total, mean]                     13100, 262.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:50  
Error Set:
Requests      [total, rate, throughput]         60, 61.02, 33.01
Duration      [total, attack, wait]             1.817s, 983.34ms, 834.031ms
Latencies     [min, mean, 50, 90, 95, 99, max]  783.193ms, 1.001s, 996.181ms, 1.196s, 1.221s, 1.241s, 1.242s
Bytes In      [total, mean]                     6120, 102.00
Bytes Out     [total, mean]                     36480, 608.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:60  
Error Set:
Requests      [total, rate, throughput]         60, 61.02, 0.00
Duration      [total, attack, wait]             983.556ms, 983.295ms, 261.673µs
Latencies     [min, mean, 50, 90, 95, 99, max]  261.673µs, 344.604µs, 312.194µs, 423.654µs, 461.93µs, 1.182ms, 1.259ms
Bytes In      [total, mean]                     5040, 84.00
Bytes Out     [total, mean]                     20100, 335.00
Success       [ratio]                           0.00%
Status Codes  [code:count]                      400:60  
Error Set:
400 Bad Request
Requests      [total, rate, throughput]         60, 61.02, 33.97
Duration      [total, attack, wait]             1.766s, 983.324ms, 782.791ms
Latencies     [min, mean, 50, 90, 95, 99, max]  756.839ms, 959.555ms, 949.716ms, 1.15s, 1.175s, 1.215s, 1.217s
Bytes In      [total, mean]                     6420, 107.00
Bytes Out     [total, mean]                     26940, 449.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:60  
Error Set:
Requests      [total, rate, throughput]         80, 81.02, 35.42
Duration      [total, attack, wait]             2.259s, 987.457ms, 1.271s
Latencies     [min, mean, 50, 90, 95, 99, max]  857.149ms, 1.171s, 1.088s, 1.514s, 1.564s, 1.604s, 1.608s
Bytes In      [total, mean]                     6560, 82.00
Bytes Out     [total, mean]                     72320, 904.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:80  
Error Set:
Requests      [total, rate, throughput]         80, 81.01, 57.31
Duration      [total, attack, wait]             1.396s, 987.499ms, 408.359ms
Latencies     [min, mean, 50, 90, 95, 99, max]  274.953ms, 397.598ms, 397.618ms, 479.861ms, 498.085ms, 521.77ms, 525.394ms
Bytes In      [total, mean]                     3520, 44.00
Bytes Out     [total, mean]                     3600, 45.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:80  
Error Set:
Requests      [total, rate, throughput]         80, 81.01, 20.72
Duration      [total, attack, wait]             3.861s, 987.506ms, 2.873s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.5s, 2.403s, 1.906s, 3.253s, 3.303s, 3.343s, 3.346s
Bytes In      [total, mean]                     7760, 97.00
Bytes Out     [total, mean]                     156000, 1950.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:80  
Error Set:
Requests      [total, rate, throughput]         90, 91.01, 53.68
Duration      [total, attack, wait]             1.677s, 988.904ms, 687.792ms
Latencies     [min, mean, 50, 90, 95, 99, max]  667.648ms, 858.169ms, 841.452ms, 1.041s, 1.063s, 1.092s, 1.096s
Bytes In      [total, mean]                     5670, 63.00
Bytes Out     [total, mean]                     1620, 18.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:90  
Error Set:
Requests      [total, rate, throughput]         100, 101.01, 46.74
Duration      [total, attack, wait]             2.139s, 990.014ms, 1.149s
Latencies     [min, mean, 50, 90, 95, 99, max]  947.834ms, 1.236s, 1.254s, 1.453s, 1.483s, 1.523s, 1.527s
Bytes In      [total, mean]                     10700, 107.00
Bytes Out     [total, mean]                     44900, 449.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:100  
Error Set:
Requests      [total, rate, throughput]         100, 101.01, 21.60
Duration      [total, attack, wait]             4.63s, 989.989ms, 3.64s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.88s, 2.957s, 2.284s, 4.014s, 4.061s, 4.101s, 4.106s
Bytes In      [total, mean]                     9700, 97.00
Bytes Out     [total, mean]                     195000, 1950.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:100  
Error Set:
Requests      [total, rate, throughput]         100, 101.01, 43.90
Duration      [total, attack, wait]             2.278s, 989.965ms, 1.288s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.034s, 1.369s, 1.398s, 1.597s, 1.641s, 1.681s, 1.686s
Bytes In      [total, mean]                     8200, 82.00
Bytes Out     [total, mean]                     90400, 904.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:100  
Error Set:
Requests      [total, rate, throughput]         120, 121.01, 43.15
Duration      [total, attack, wait]             2.781s, 991.617ms, 1.789s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.165s, 1.562s, 1.418s, 2.026s, 2.077s, 2.116s, 2.122s
Bytes In      [total, mean]                     12840, 107.00
Bytes Out     [total, mean]                     111360, 928.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:120  
Error Set:
Requests      [total, rate, throughput]         120, 121.01, 48.92
Duration      [total, attack, wait]             2.453s, 991.652ms, 1.462s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.125s, 1.495s, 1.53s, 1.774s, 1.823s, 1.864s, 1.869s
Bytes In      [total, mean]                     12240, 102.00
Bytes Out     [total, mean]                     72960, 608.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:120  
Error Set:
Requests      [total, rate, throughput]         120, 121.01, 19.34
Duration      [total, attack, wait]             6.205s, 991.689ms, 5.213s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.453s, 3.617s, 4.506s, 4.905s, 5.242s, 5.282s, 5.288s
Bytes In      [total, mean]                     11640, 97.00
Bytes Out     [total, mean]                     234000, 1950.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:120  
Error Set: